---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofSlopeExceedsThreshold
source: html/d6549811-2c3b-c8da-a7f5-5fd4ef21d012.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofSlopeExceedsThreshold Property

Thickness of this Roof may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in
 sections and details may not accurately indicate the Thickness shown in Type Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofSlopeExceedsThreshold { get; }
```